backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 133584]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 9.999999747378752e-05, l2: 0.0}
      name: dense_21
      trainable: true
      units: 12
      use_bias: true
  name: sequential_8
keras_version: 2.2.4
